Revit 2026 API

# MarbleTextureAngle Property

---

The property labeled "Angle" from the "Marble" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureAngle { get; }
```
```vb
Public Shared ReadOnly Property TextureAngle As String
	Get
```
```cpp
public:
static property String^ TextureAngle {
	String^ get ();
}
```
```fsharp
static member TextureAngle : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray3d".

#### Reference

Marble Class

Autodesk.Revit.DB.Visual Namespace